In [1]:
import pandas as pd
import numpy as np

In [35]:
a = pd.Series([1,2,3])
a

0    1
1    2
2    3
dtype: int64

In [39]:
df = pd.DataFrame(data=[a,a**2,a**3,a**4],index=[1,2,3,4])
# df = pd.DataFrame(data=a)
df

   0   1   2
1  1   2   3
2  1   4   9
3  1   8  27
4  1  16  81

In [41]:
a = df.iloc[:,0].sum()
b = df.iloc[:,1].sum()
c = df.iloc[:,2].sum()

df.loc[4] = [a,b,c]
df

   0   1    2
1  1   2    3
2  1   4    9
3  1   8   27
4  4  30  120

In [61]:
a = pd.Series([1, 2, 3])
b = pd.DataFrame(data=[a,a,a,a])
b

   0  1  2
0  1  2  3
1  1  2  3
2  1  2  3
3  1  2  3